// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Este software debe ser instalado en el volumen de inicio.";
"ERROR_INSTALL" = "Este volumen no cumple con los requisitos necesarios para esta actualización ";

"Newer_Package_Installed_message" = "Una versión más reciente de Chameleon ya ha sido instalada.";
"Intel_Mac_message" = "Este software no puede ser instalado en este ordenador.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Bootloader Chameleon";
"Chameleon_description" = "Chameleon requiere tres archivos esenciales (en términos simples).
boot0 (En el MBR del disco) responsable de cargar boot1.
boot1 (En el sector de arranque de la partición) para colocar boot2.
boot2 (En el directorio raíz de la partición) para cargar el kernel, etc.";

"Standard_title" = "Estándar";
"Standard_description" = "Instalar los archivos de Chameleon al directorio raíz de la partición seleccionada, usando boot0 o boot0md dependiendo de su sistema, sin destruir ninguna instalación de Windows si usted la tiene";

"EFI_title" = "EFI";
"EFI_description" = "Instalar los archivos de Chameleon a la partición EFI normalmente oculta, usando boot0 o boot0md dependiendo de su sistema, sin destruir ninguna instalación de Windows si usted la tiene.";

"noboot_title" = "No instalar el Bootloader";
"noboot_description" = "Útil si usted desea instalar solamente los componentes Extras)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Módulos de Chameleon";
"Module_description" = "El sistema de módulos incorporado en chameleon permite al usuario o desarrollador extender las funcionalidades principales del bootloader, sin reempalzar el binario principal boot. ";

"klibc_title" = "klibc";
"klibc_description" = "Este módulo provee una biblioteca estándar c, para que los módulos conecten aún si la biblioteca proporcionada por chameleon es insuficiente.
Es en la actualidad solamente usado por la biblioteca uClibc++.
Recurso: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "AutoResolución";
"AutoReso_description" = "Este módulo lee la información EDID desde el monitor conectado a la pantalla principal.
El módulo no está actualmente integrado a la troncal (trunk) principal, por tener un mínimo uso tal y como están las cosas.
Adicionalmente, el módulo parcheará los modos VESA disponibles en tarjetas gráficas pre HD de INTEL, lo cual proveerá una resolución apropiada durante el arranque.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Este módulo provee una biblioteca de tiempo de ejecución minimalista c++ para usar en otros módulos.
Esto no proporciona funcionalidad por sí mismo, en su lugar se utiliza para permitir que el lenguaje c++ sea utilizado en otros módulos.
Por favor tenga en cuenta que rtti y excepciones han sido ambas deshabilitadas.
Recurso: http://cxx.uclibc.org/
Dependencias: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "This module permits the user to define the keyboard key mappings.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilidades";
"Utility_description" = "Archivos opcionales para facilitar la configuración";

"PrefPanel_title" = "Panel de Preferencias";
"PrefPanel_description" = "Instala el Panel de Preferencias para Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Copia un ejemplo de Perfil smbios.plist en /Extra/Configuration.";

"Documentation_title" = "Documentación";
"Documentation_description" = "Documentación de Chameleon, para su instalación manual y uso";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opciones de Arranque";
"Options_description" = "Crear un archivo /Extra/org.chameleon.Boot.plist y seleccionar las opciones deseadas para configurar los parámetros de Chameleon.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Oculta la interfaz gráfica GUI de Chameleon.";

"GUI_title" = "GUI=No";
"GUI_description" = "Desactiva la interfaz gráfica, agrega GUI=n al org.chameleon.Boot.plist";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Usar el tradicional logo de Apple (gris sobre blanco) durante el arranque en pantalla, en vez de la imagen boot.png del tema.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Muestra la pantalla de selección de particiones sin el tiempo de espera.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Habilita el modo de arranque silencioso (sin mensajes o cursor).";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Deshabilita el texto en pantalla sobre las particiones y detalles de resolución.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pausa el proceso de arranque después de que Chameleon ha finalizado de configurar, en espera de presionar una tecla para cargar el kernel. Útil al ser combinado con el modo verbose cuando hay problemas.";

"SkipFTFix_title" = "SkipFTFix=Yes";
"SkipFTFix_description" = "A temporary work around for this breaking RAID booting.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Carga el kernel en modo 32bit, en vez de usar el modo por defecto de 64bit.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Esta opción corrige cualquier problema de los puertos EHCI debido a malas BIOS.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Agrega EthernetBuiltIn=y al org.chameleon.Boot.plist para la 'integración' con el dispositivo Ethernet para Time Machine.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Habilita el HPET en chipsets intel, para aquellas BIOS que no incluyen dicha opción.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Habilita la opción de ignorar imágenes de reposo o hibernación defectuosas.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Deshabilita la opción predeterminada de arreglo del Reinicio.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Reconfigura los controladores UHCI antes de iniciar OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Deshabilita el reconocimiento automatico de RAM predeterminado.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "For Lion only. Enables loading of the pre-linked kernel. This will ignore /E/E and /S/L/E. ONLY use this is you have know it contains everything you need.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Intenta cargar la imagen de reposo salvada desde la última hibernación.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Nuevo flag para generar C-States usando los registros SystemIO en lugar de FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Descarta las tablas SSDT anexas a la placa base.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Habilita el estado específico del Procesador, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Habilita el estado específico del Procesador, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Habilita el estado específico del Procesador, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Habilita la generación automática de estados de reposo o C-States del procesador.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Habilita la generación automática de estados de carga o P-States del procesador.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Habilita la autodetección de GPUs NVIDIA e inyecta la información correcta.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Habilita las opciones AtiROM.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Habilita las opciones NvidiaROM.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "En gráficas NVIDIA habilita la opción VBIOS";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Colocar el flag npci=0x2000 en Kernel Flags. Útil desde la 10.6.8 para el problema PCI Configuration Begin.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Use the keyboard layout for a German Mac keyboard";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Use the keyboard layout for a Spanish Mac keyboard";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Use the keyboard layout for a French Mac keyboard";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Use the keyboard layout for an Italian Mac keyboard";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Use the keyboard layout for a Swedish Mac keyboard";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Use the keyboard layout for a French PC keyboard";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Versión simplificada del nuevo tema por defecto, esto se acostumbra cada vez que se crean nuevas versiones de Chameleon, es requerido.";

"Legacy_title" = "Legacy";
"Legacy_description" = "El tema anterior por defecto de Chameleon";

"Default_title" = "Estándar";
"Default_description" = "El nuevo tema predeterminado de Chameleon";

"Bullet_title" = "Bullet";
"Bullet_description" = "El tema Bullet de Nosmokingbandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Resolución";
"Resolution_description" = "Permite fijar la resolución de pantalla para nuestro monitor";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Set one keylayout to use, or select 'None' if you don't want to select a keylayout.";

// Themes
"Themes_title" = "Temas";
"Themes_description" = "Una colección de Temas de muestra.
Puedes encontrar más temas en http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
